[
  {
    "title": "AAAI 2026 NSF Student Travel Award",
    "year": "2026",
    "description": "Received NSF Student Travel Award to attend and present at the AAAI 2026 conference."
  },
  {
    "title": "2025 NSF CPS Rising Stars",
    "year": "2025",
    "description": "Selected to participate (17% acceptance rate) for the NSF Cyber-Physical Systems Rising Stars Workshop at Vanderbilt University, recognizing research excellence and academic leadership potential."
  },
  {
    "title": "IEEE/ACM CHASE 2024 NSF Travel Award (Grant)",
    "year": "2024",
    "description": "Honored for research excellence and presentation in Wilmington, Delaware. Received the NSF Travel Award, acknowledging the high esteem of the accepted paper."
  },
  {
    "title": "Vanderbilt Awards for Doctoral Discovery (VADD)",
    "year": "2024",
    "description": "Awarded for research excellence and presentation in Wilmington, Delaware, at Vanderbilt University."
  },
  {
    "title": "ICCPS 2024 NSF Travel Grant",
    "year": "2024",
    "description": "Recognized for research excellence to travel to Hong Kong to further develop research skill in the domain of Cyber-Physical System."
  },
  {
    "title": "UbiComp/ISWC 2023 Travel Grant",
    "year": "2023",
    "description": "Recognized for the research work and presented at Cancun, Mexico for accepted paper."
  },
  {
    "title": "Vanderbilt University Travel Grant",
    "year": "2023",
    "description": "Recognized for the research work in the intersection of physical therapy and AI, traveling to present the work in 2023."
  },
  {
    "title": "Magna Cum Laude",
    "year": "2021",
    "description": "Recognized for academic excellence by Donald Bren School of Information and Computer Science at UC Irvine."
  },
  {
    "title": "Specialization in Intelligent Systems",
    "year": "2021",
    "description": "Achieved specialization through dedicated coursework and projects at UC Irvine."
  },
  {
    "title": "Dean's Honor List",
    "year": "2017-2021",
    "description": "Consistently maintained high GPA to be recognized on the Dean's List at UC Irvine."
  }
]
