[
  {
    "title": "Mentor, Students Projects",
    "organization": "Vanderbilt University",
    "location": "Nashville, TN",
    "startDate": "2021-08",
    "endDate": "Present",
    "type": "mentoring",
    "highlights": [
      {
        "date": "2025–Present",
        "notes": "Mentoring undergraduate Daniel Park on extension work for ICCPS 2025.",
        "mentees": [
          {
            "name": "Daniel Park",
            "website": ""
          }
        ]
      },
      {
        "date": "2025–Present",
        "notes": "Mentoring undergraduate Selena Xu on GENIUS project for explainable and responsible AI.",
        "mentees": [
          {
            "name": "Selena Xu",
            "website": ""
          }
        ]
      },
      {
        "date": "2024–2025",
        "notes": "Mentored master's student Yiling Liu and undergraduates Haowei Fu and Christin Ann Sanchez on \"SmartSeg: A Non-Parametric Approach for Smart Glass Video Segmentation,\" an event segmentation project for a nursing training simulation.",
        "mentees": [
          {
            "name": "Yiling Liu",
            "website": ""
          },
          {
            "name": "Haowei Fu",
            "website": ""
          },
          {
            "name": "Christin Ann Sanchez",
            "website": ""
          }
        ]
      },
      {
        "date": "2024–2025",
        "notes": "Mentored undergraduate Haoran (Max) Ma on an IMU-guided video classification project to improve model accuracy."
      },
      {
        "date": "2024–2025",
        "notes": "Mentored undergraduate Siwoo Bae on \"Learning with Preserving for Continual Multitask Learning,\" focused on preserving representational space in continual learning. The work was presented at the Vanderbilt Undergraduate Research Fair, earning a poster award."
      },
      {
        "date": "2022–2024",
        "notes": "Mentored undergraduate Xutong (Helen) Sun and Yashvitha Thatigotla on \"EXACT: A Meta-Learning Framework for Precise Exercise Segmentation in Physical Therapy.\""
      },
      {
        "date": "2022–2023",
        "notes": "Mentored undergraduates Anna Chen on projects in iOS app development, Unity visualization, and data analysis for micro-level exercise explainability, notably \"MicroXercise: A Micro-Level Comparative and Explainable System for Remote Physical Therapy.\""
      },
      {
        "date": "2021–2022",
        "notes": "Mentored undergraduates David Atwood and Melissa Wang on \"PhysiQ: Off-Site Quality Assessment of Exercise in Physical Therapy.\""
      }
    ]
  },
  {
    "title": "Volunteer, Mission Autonomy Hackathon",
    "organization": "Vanderbilt University & AWS",
    "location": "Nashville, TN",
    "startDate": "2025-10",
    "endDate": "2025-10",
    "type": "volunteer",
    "highlights": [
      "Assisted with student organization and coordination for the Mission Autonomy Hackathon.",
      "Helped manage logistics and location setup for the hackathon event.",
      "Supported participants and organizers throughout the event."
    ]
  },
  {
    "title": "Volunteer, PhD Orientation Talk",
    "organization": "Vanderbilt University",
    "location": "Nashville, TN",
    "startDate": "2025-08",
    "endDate": "2025-08",
    "type": "volunteer",
    "highlights": [
      "Delivered a talk sharing personal PhD experience and insights with incoming graduate students.",
      "Provided guidance and advice to new students about navigating the PhD journey.",
      "Answered questions about research, coursework, and academic life at Vanderbilt."
    ]
  },
  {
    "title": "Volunteer, NSF CPS PI Meeting",
    "organization": "Vanderbilt University",
    "location": "Nashville, TN",
    "startDate": "2025-03",
    "endDate": "2025-03",
    "type": "volunteer",
    "highlights": [
      "Volunteered approximately 4-6 hours during the Principal Investigators meeting.",
      "Assisted with the setup for the poster and demonstration sessions.",
      "Provided guidance to presenters and attendees during these sessions.",
      "Helped with troubleshooting technical issues during the poster and demo sessions."
    ]
  },
  {
    "title": "Graduate Honor Council Panelist",
    "organization": "Vanderbilt University",
    "location": "Nashville, TN",
    "startDate": "2024-02",
    "endDate": "2025-02",
    "type": "service",
    "highlights": [
      "Acted as a panelist to understand and justify the accused student and his/her innocence towards Vanderbilt School Honor Codes.",
      "Reviewed the materials of the accused, student and accusers, instructors to capture the full story of the situation and discussed the potential violation of the honor code at graduate school level."
    ]
  },
  {
    "title": "Volunteer, IEEE/ACM CHASE",
    "organization": "IEEE/ACM",
    "location": "Wilmington, DE",
    "startDate": "2024-06",
    "endDate": "2024-06",
    "type": "volunteer",
    "highlights": [
      "Worked around 10 hours in total for the period of 3 days at the conference; helped at the registration desk to guide conference participants and to distribute conference materials.",
      "Communicated and introduced the general guideline and schedules; organized the poster sessions for clarification of locations, materials gathering, and assistance of troubleshooting."
    ]
  },
  {
    "title": "Volunteer, Graduate Student Recruitment Day",
    "organization": "Vanderbilt University",
    "location": "Nashville, TN",
    "startDate": "2024-03",
    "endDate": "2024-03",
    "type": "volunteer",
    "highlights": [
      "Toured the new student body to different departments and building on campus at Vanderbilt University.",
      "Communicated and introduced the research works at Institute for Software Integrated Systems at Vanderbilt University.",
      "Discussed the experiences and future directions with faculties and new recruits."
    ]
  },
  {
    "title": "Volunteer, SmartComp 2023",
    "organization": "IEEE",
    "location": "Nashville, TN",
    "startDate": "2023-06-26",
    "endDate": "2023-06-29",
    "type": "volunteer",
    "highlights": [
      "Provided volunteer support during the SmartComp 2023 conference for four days.",
      "Organized posters, provided guidance to presenters, and assisted with running errands.",
      "Assisted in organizing presentations and panels, ensuring smooth transitions and timely schedules.",
      "Collaborated with the conference team to create a positive and engaging environment for attendees.",
      "Contributed to the overall success of the conference by fulfilling various volunteer responsibilities."
    ]
  }
]
